api/app/Models/User.php

    public function getByEmail($email): array|null
    {
        return $this->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'iansousa01@gmail.com'
 LIMIT 1