api/app/Controllers/Student.php

    public function index()
    {
        try {

            $token = Authorization::verify($this->request->getHeaderLine('Authorization'));
            JWT::decode($token, new Key("123456789", "HS256"));

            $students = $this->student_model->findAll();
---
SELECT *
FROM `students`

    public function show($id = null)
    {
        try {

            $token = Authorization::verify($this->request->getHeaderLine('Authorization'));
            JWT::decode($token, new Key("123456789", "HS256"));

            $student = $this->student_model->find($id);
---
SELECT *
FROM `students`
WHERE `students`.`id` = '7'

                unset($data['profilePicture']);
            }

            $student_id = $this->student_model->insert($data, true);
---
INSERT INTO `students` (`name`, `email`, `address`, `phone`, `profile_picture_uri`) VALUES ('teseeeeee', 'teseeee@gmail.com', '1234', '4321', 'profile_pic_66aa69a9c269f0.14637176.jpg')

    public function delete($id = null)
    {
        try {
            $token = Authorization::verify($this->request->getHeaderLine('Authorization'));
            JWT::decode($token, new Key("123456789", "HS256"));

            $student = $this->student_model->find($id);

            if ($student === null) {
                return $this->failNotFound('No student found with id: ' . $id);
            }

            $this->student_model->delete($id);
---
SELECT *
FROM `students`
WHERE `students`.`id` = '6'
DELETE FROM `students`
WHERE `id` IN ('6')